Repository: HappyBasher/atftp
Catalog: debian/po/*.po
Languages: cs

source: Should the server be started by inetd?
cs: Má se server spou¹tìt pøes inetd?

source: atftpd can be started by the inetd superserver or as a daemon and handle incoming connections by itself. The latter is only recommend for very high usage server.
cs: atftpd mù¾e bì¾et jako samostatný daemon a sám zpracovávat pøíchozí po¾adavky, nebo mù¾e být spou¹tìn z metaserveru inetd. První mo¾nost je doporuèená pouze pro velmi vytí¾ené servery.

source: Server timeout:
cs: Èasový limit serveru:

source: How many seconds the main thread waits before exiting.
cs: Kolik sekund má hlavní vlákno èekat, ne¾ se ukonèí.

source: Retry timeout:
cs: Èasový limit opakování:

source: How many seconds to wait for a reply before retransmitting a packet.
cs: Kolik sekund má server èekat na odpovìï, ne¾ paket ode¹le znovu.

source: Maximum number of threads:
cs: Maximální poèet vláken:

source: Maximum number of concurrent threads that can be running.
cs: Maximální poèet souèasnì bì¾ících vláken.

source: Verbosity level:
cs: Míra upovídanosti:

source: Level of logging. 7 logs everything including debug logs. 1 will log only the system critical logs. 5 (LOG_NOTICE) is the default value.
cs: 7 zaznamená v¹e vèetnì ladicích hlá¹ení. 1 zaznamená pouze kritické záznamy, 5 (LOG_NOTICE) je výchozí hodnota.

source: Enable 'timeout' support?
cs: Povolit podporu 'timeout'?

source: Enable 'tsize' support?
cs: Povolit podporu 'tsize'?

source: Enable 'block size' support?
cs: Povolit podporu 'block size'?

source: Enable multicast support?
cs: Povolit podporu multicastu?

source: Port to listen for tftp request:
cs: Port, na kterém se má naslouchat tftp po¾adavkùm:

source: Port range for multicast file transfer:
cs: Rozsah portù pro hromadný (multicast) pøenos souborù:

source: Multicast transfer will use any available port in a given set. For example, "2000-2003, 3000" allow atftpd to use port 2000 to 2003 and 3000.
cs: Pro hromadný pøenos pou¾ijí libovolné porty ze zadané mno¾iny. Napøíklad "2000-2003, 3000" dovolí atftpd pou¾ít porty 2000 a¾ 2003 a port 3000.

source: Address range for multicast transfer:
cs: Rozsah adres pro hromadné pøenosy:

source: Multicast transfer will use any available addresses from a given set of addresses. Syntax is "a.b.c.d-d,a.b.c.d,..."
cs: Pro hromadný pøenos pou¾ijí libovolné adresy ze zadané mno¾iny adres. Syntaxe je následující: "a.b.c.d-d,a.b.c.d,..."

source: Log to file instead of syslog?
cs: Nepou¾ívat pro záznamy syslog, ale samostatný soubor?

source: If your server does intensive tftp file serving, it is a good idea to accept here. That will avoid cluttering your syslog with tftpd logs.
cs: Pokud bude vá¹ server nabízet tftp soubory mnoha klientùm, je dobré tuto mo¾nost povolit, proto¾e se pak záznamy tftpd nebudou míchat se záznamy syslogu.

source: Log file:
cs: Soubor pro záznamy:

source: A file where atftpd will write its logs. This file will be made writable for the user 'nobody' and group 'nogroup'.
cs: Soubor, do kterého bude atftpd zapisovat své záznamy. Práva souboru budou nastavena tak, aby do nìj mohl zapisovat u¾ivatel 'nobody' a skupina 'nogroup'.

source: Base directory:
cs: Základní adresáø:

source: The directory tree from where atftpd can serve files. That directory must be world readable.
cs: Adresáøový strom, ze kterého atftpd nabízí soubory. Adresáø musí být èitelný pro v¹echny.
